ra-rs/ra/svd/vendor/R7FA6T2BD.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>ICU</name>
            <description>Interrupt Controller</description>
            <baseAddress>0x40006000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x120</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x130</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x140</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A0</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x200</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x280</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x300</offset>
                <size>384</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>IEL0</name>
                <description>ICU Interrupt 0</description>
                <value>0</value>
            </interrupt>
            <interrupt>
                <name>IEL1</name>
                <description>ICU Interrupt 1</description>
                <value>1</value>
            </interrupt>
            <interrupt>
                <name>IEL2</name>
                <description>ICU Interrupt 2</description>
                <value>2</value>
            </interrupt>
            <interrupt>
                <name>IEL3</name>
                <description>ICU Interrupt 3</description>
                <value>3</value>
            </interrupt>
            <interrupt>
                <name>IEL4</name>
                <description>ICU Interrupt 4</description>
                <value>4</value>
            </interrupt>
            <interrupt>
                <name>IEL5</name>
                <description>ICU Interrupt 5</description>
                <value>5</value>
            </interrupt>
            <interrupt>
                <name>IEL6</name>
                <description>ICU Interrupt 6</description>
                <value>6</value>
            </interrupt>
            <interrupt>
                <name>IEL7</name>
                <description>ICU Interrupt 7</description>
                <value>7</value>
            </interrupt>
            <interrupt>
                <name>IEL8</name>
                <description>ICU Interrupt 8</description>
                <value>8</value>
            </interrupt>
            <interrupt>
                <name>IEL9</name>
                <description>ICU Interrupt 9</description>
                <value>9</value>
            </interrupt>
            <interrupt>
                <name>IEL10</name>
                <description>ICU Interrupt 10</description>
                <value>10</value>
            </interrupt>
            <interrupt>
                <name>IEL11</name>
                <description>ICU Interrupt 11</description>
                <value>11</value>
            </interrupt>
            <interrupt>
                <name>IEL12</name>
                <description>ICU Interrupt 12</description>
                <value>12</value>
            </interrupt>
            <interrupt>
                <name>IEL13</name>
                <description>ICU Interrupt 13</description>
                <value>13</value>
            </interrupt>
            <interrupt>
                <name>IEL14</name>
                <description>ICU Interrupt 14</description>
                <value>14</value>
            </interrupt>
            <interrupt>
                <name>IEL15</name>
                <description>ICU Interrupt 15</description>
                <value>15</value>
            </interrupt>
            <interrupt>
                <name>IEL16</name>
                <description>ICU Interrupt 16</description>
                <value>16</value>
            </interrupt>
            <interrupt>
                <name>IEL17</name>
                <description>ICU Interrupt 17</description>
                <value>17</value>
            </interrupt>
            <interrupt>
                <name>IEL18</name>
                <description>ICU Interrupt 18</description>
                <value>18</value>
            </interrupt>
            <interrupt>
                <name>IEL19</name>
                <description>ICU Interrupt 19</description>
                <value>19</value>
            </interrupt>
            <interrupt>
                <name>IEL20</name>
                <description>ICU Interrupt 20</description>
                <value>20</value>
            </interrupt>
            <interrupt>
                <name>IEL21</name>
                <description>ICU Interrupt 21</description>
                <value>21</value>
            </interrupt>
            <interrupt>
                <name>IEL22</name>
                <description>ICU Interrupt 22</description>
                <value>22</value>
            </interrupt>
            <interrupt>
                <name>IEL23</name>
                <description>ICU Interrupt 23</description>
                <value>23</value>
            </interrupt>
            <interrupt>
                <name>IEL24</name>
                <description>ICU Interrupt 24</description>
                <value>24</value>
            </interrupt>
            <interrupt>
                <name>IEL25</name>
                <description>ICU Interrupt 25</description>
                <value>25</value>
            </interrupt>
            <interrupt>
                <name>IEL26</name>
                <description>ICU Interrupt 26</description>
                <value>26</value>
            </interrupt>
            <interrupt>
                <name>IEL27</name>
                <description>ICU Interrupt 27</description>
                <value>27</value>
            </interrupt>
            <interrupt>
                <name>IEL28</name>
                <description>ICU Interrupt 28</description>
                <value>28</value>
            </interrupt>
            <interrupt>
                <name>IEL29</name>
                <description>ICU Interrupt 29</description>
                <value>29</value>
            </interrupt>
            <interrupt>
                <name>IEL30</name>
                <description>ICU Interrupt 30</description>
                <value>30</value>
            </interrupt>
            <interrupt>
                <name>IEL31</name>
                <description>ICU Interrupt 31</description>
                <value>31</value>
            </interrupt>
            <interrupt>
                <name>IEL32</name>
                <description>ICU Interrupt 32</description>
                <value>32</value>
            </interrupt>
            <interrupt>
                <name>IEL33</name>
                <description>ICU Interrupt 33</description>
                <value>33</value>
            </interrupt>
            <interrupt>
                <name>IEL34</name>
                <description>ICU Interrupt 34</description>
                <value>34</value>
            </interrupt>
            <interrupt>
                <name>IEL35</name>
                <description>ICU Interrupt 35</description>
                <value>35</value>
            </interrupt>
            <interrupt>
                <name>IEL36</name>
                <description>ICU Interrupt 36</description>
                <value>36</value>
            </interrupt>
            <interrupt>
                <name>IEL37</name>
                <description>ICU Interrupt 37</description>
                <value>37</value>
            </interrupt>
            <interrupt>
                <name>IEL38</name>
                <description>ICU Interrupt 38</description>
                <value>38</value>
            </interrupt>
            <interrupt>
                <name>IEL39</name>
                <description>ICU Interrupt 39</description>
                <value>39</value>
            </interrupt>
            <interrupt>
                <name>IEL40</name>
                <description>ICU Interrupt 40</description>
                <value>40</value>
            </interrupt>
            <interrupt>
                <name>IEL41</name>
                <description>ICU Interrupt 41</description>
                <value>41</value>
            </interrupt>
            <interrupt>
                <name>IEL42</name>
                <description>ICU Interrupt 42</description>
                <value>42</value>
            </interrupt>
            <interrupt>
                <name>IEL43</name>
                <description>ICU Interrupt 43</description>
                <value>43</value>
            </interrupt>
            <interrupt>
                <name>IEL44</name>
                <description>ICU Interrupt 44</description>
                <value>44</value>
            </interrupt>
            <interrupt>
                <name>IEL45</name>
                <description>ICU Interrupt 45</description>
                <value>45</value>
            </interrupt>
            <interrupt>
                <name>IEL46</name>
                <description>ICU Interrupt 46</description>
                <value>46</value>
            </interrupt>
            <interrupt>
                <name>IEL47</name>
                <description>ICU Interrupt 47</description>
                <value>47</value>
            </interrupt>
            <interrupt>
                <name>IEL48</name>
                <description>ICU Interrupt 48</description>
                <value>48</value>
            </interrupt>
            <interrupt>
                <name>IEL49</name>
                <description>ICU Interrupt 49</description>
                <value>49</value>
            </interrupt>
            <interrupt>
                <name>IEL50</name>
                <description>ICU Interrupt 50</description>
                <value>50</value>
            </interrupt>
            <interrupt>
                <name>IEL51</name>
                <description>ICU Interrupt 51</description>
                <value>51</value>
            </interrupt>
            <interrupt>
                <name>IEL52</name>
                <description>ICU Interrupt 52</description>
                <value>52</value>
            </interrupt>
            <interrupt>
                <name>IEL53</name>
                <description>ICU Interrupt 53</description>
                <value>53</value>
            </interrupt>
            <interrupt>
                <name>IEL54</name>
                <description>ICU Interrupt 54</description>
                <value>54</value>
            </interrupt>
            <interrupt>
                <name>IEL55</name>
                <description>ICU Interrupt 55</description>
                <value>55</value>
            </interrupt>
            <interrupt>
                <name>IEL56</name>
                <description>ICU Interrupt 56</description>
                <value>56</value>
            </interrupt>
            <interrupt>
                <name>IEL57</name>
                <description>ICU Interrupt 57</description>
                <value>57</value>
            </interrupt>
            <interrupt>
                <name>IEL58</name>
                <description>ICU Interrupt 58</description>
                <value>58</value>
            </interrupt>
            <interrupt>
                <name>IEL59</name>
                <description>ICU Interrupt 59</description>
                <value>59</value>
            </interrupt>
            <interrupt>
                <name>IEL60</name>
                <description>ICU Interrupt 60</description>
                <value>60</value>
            </interrupt>
            <interrupt>
                <name>IEL61</name>
                <description>ICU Interrupt 61</description>
                <value>61</value>
            </interrupt>
            <interrupt>
                <name>IEL62</name>
                <description>ICU Interrupt 62</description>
                <value>62</value>
            </interrupt>
            <interrupt>
                <name>IEL63</name>
                <description>ICU Interrupt 63</description>
                <value>63</value>
            </interrupt>
            <interrupt>
                <name>IEL64</name>
                <description>ICU Interrupt 64</description>
                <value>64</value>
            </interrupt>
            <interrupt>
                <name>IEL65</name>
                <description>ICU Interrupt 65</description>
                <value>65</value>
            </interrupt>
            <interrupt>
                <name>IEL66</name>
                <description>ICU Interrupt 66</description>
                <value>66</value>
            </interrupt>
            <interrupt>
                <name>IEL67</name>
                <description>ICU Interrupt 67</description>
                <value>67</value>
            </interrupt>
            <interrupt>
                <name>IEL68</name>
                <description>ICU Interrupt 68</description>
                <value>68</value>
            </interrupt>
            <interrupt>
                <name>IEL69</name>
                <description>ICU Interrupt 69</description>
                <value>69</value>
            </interrupt>
            <interrupt>
                <name>IEL70</name>
                <description>ICU Interrupt 70</description>
                <value>70</value>
            </interrupt>
            <interrupt>
                <name>IEL71</name>
                <description>ICU Interrupt 71</description>
                <value>71</value>
            </interrupt>
            <interrupt>
                <name>IEL72</name>
                <description>ICU Interrupt 72</description>
                <value>72</value>
            </interrupt>
            <interrupt>
                <name>IEL73</name>
                <description>ICU Interrupt 73</description>
                <value>73</value>
            </interrupt>
            <interrupt>
                <name>IEL74</name>
                <description>ICU Interrupt 74</description>
                <value>74</value>
            </interrupt>
            <interrupt>
                <name>IEL75</name>
                <description>ICU Interrupt 75</description>
                <value>75</value>
            </interrupt>
            <interrupt>
                <name>IEL76</name>
                <description>ICU Interrupt 76</description>
                <value>76</value>
            </interrupt>
            <interrupt>
                <name>IEL77</name>
                <description>ICU Interrupt 77</description>
                <value>77</value>
            </interrupt>
            <interrupt>
                <name>IEL78</name>
                <description>ICU Interrupt 78</description>
                <value>78</value>
            </interrupt>
            <interrupt>
                <name>IEL79</name>
                <description>ICU Interrupt 79</description>
                <value>79</value>
            </interrupt>
            <interrupt>
                <name>IEL80</name>
                <description>ICU Interrupt 80</description>
                <value>80</value>
            </interrupt>
            <interrupt>
                <name>IEL81</name>
                <description>ICU Interrupt 81</description>
                <value>81</value>
            </interrupt>
            <interrupt>
                <name>IEL82</name>
                <description>ICU Interrupt 82</description>
                <value>82</value>
            </interrupt>
            <interrupt>
                <name>IEL83</name>
                <description>ICU Interrupt 83</description>
                <value>83</value>
            </interrupt>
            <interrupt>
                <name>IEL84</name>
                <description>ICU Interrupt 84</description>
                <value>84</value>
            </interrupt>
            <interrupt>
                <name>IEL85</name>
                <description>ICU Interrupt 85</description>
                <value>85</value>
            </interrupt>
            <interrupt>
                <name>IEL86</name>
                <description>ICU Interrupt 86</description>
                <value>86</value>
            </interrupt>
            <interrupt>
                <name>IEL87</name>
                <description>ICU Interrupt 87</description>
                <value>87</value>
            </interrupt>
            <interrupt>
                <name>IEL88</name>
                <description>ICU Interrupt 88</description>
                <value>88</value>
            </interrupt>
            <interrupt>
                <name>IEL89</name>
                <description>ICU Interrupt 89</description>
                <value>89</value>
            </interrupt>
            <interrupt>
                <name>IEL90</name>
                <description>ICU Interrupt 90</description>
                <value>90</value>
            </interrupt>
            <interrupt>
                <name>IEL91</name>
                <description>ICU Interrupt 91</description>
                <value>91</value>
            </interrupt>
            <interrupt>
                <name>IEL92</name>
                <description>ICU Interrupt 92</description>
                <value>92</value>
            </interrupt>
            <interrupt>
                <name>IEL93</name>
                <description>ICU Interrupt 93</description>
                <value>93</value>
            </interrupt>
            <interrupt>
                <name>IEL94</name>
                <description>ICU Interrupt 94</description>
                <value>94</value>
            </interrupt>
            <interrupt>
                <name>IEL95</name>
                <description>ICU Interrupt 95</description>
                <value>95</value>
            </interrupt>
            <registers>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x1</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>IRQCR%s</name>
                    <description>IRQ Control Register %s</description>
                    <addressOffset>0x000</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>IRQMD</name>
                            <description>IRQi Detection Sense Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Falling edge</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Rising edge</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Rising and falling edges</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Low level</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCLKSEL</name>
                            <description>IRQi Digital Filter Sampling Clock Select</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>PCLKB</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>PCLKB/8</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>PCLKB/32</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>PCLKB/64</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FLTEN</name>
                            <description>IRQi Digital Filter Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Digital filter is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Digital filter is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
