ra-rs/ra/svd/vendor/R7FA6T2BD.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PFS_B</name>
            <description>Pmn Pin Function Control Register</description>
            <baseAddress>0x4001F800</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x84</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x280</offset>
                <size>56</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2B8</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2CC</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2D0</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2F0</offset>
                <size>172</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3A0</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x50C</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x514</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x530</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x538</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x558</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x55C</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x560</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x564</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x568</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x004</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>P00%sPFS</name>
                    <description>Port 00%s Pin Function Select Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xfffffffd</resetMask>
                    <fields>
                        <field>
                            <name>PODR</name>
                            <description>Port Output Data</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Low output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>High output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDR</name>
                            <description>Pmn State</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Low level</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>High level</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PDR</name>
                            <description>Port Direction</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Input (functions as an input pin)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Output (functions as an output pin)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCR</name>
                            <description>Pull-up Control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable input pull-up</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable input pull-up</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NCODR</name>
                            <description>N-Channel Open-Drain Control</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CMOS output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>NMOS open-drain output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DSCR</name>
                            <description>Port Drive Capability</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Low drive</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Middle drive</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>High-speed high-drive / High current drive</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>High drive</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISEL</name>
                            <description>IRQ Input Enable</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not used as an IRQn input pin</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Used as an IRQn input pin</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASEL</name>
                            <description>Analog Input Enable</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not used as an analog pin</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Used as an analog pin</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PMR</name>
                            <description>Port Mode Control</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Used as a general I/O pin</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Used as an I/O port for peripheral functions</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PSEL</name>
                            <description>Peripheral Select</description>
                            <lsb>24</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x004</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>P00%sPFS_HA</name>
                    <description>Port 00%s Pin Function Select Register</description>
                    <alternateRegister>P00%sPFS</alternateRegister>
                    <addressOffset>0x000</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xfffd</resetMask>
                    <fields>
                        <field>
                            <name>PODR</name>
                            <description>Port Output Data</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Low output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>High output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDR</name>
                            <description>Pmn State</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Low level</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>High level</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PDR</name>
                            <description>Port Direction</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Input (functions as an input pin)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Output (functions as an output pin)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCR</name>
                            <description>Pull-up Control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable input pull-up</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable input pull-up</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NCODR</name>
                            <description>N-Channel Open-Drain Control</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CMOS output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>NMOS open-drain output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DSCR</name>
                            <description>Port Drive Capability</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Low drive</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Middle drive</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>High-speed high-drive / High current drive</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>High drive</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISEL</name>
                            <description>IRQ Input Enable</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not used as an IRQn input pin</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Used as an IRQn input pin</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASEL</name>
                            <description>Analog Input Enable</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not used as an analog pin</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Used as an analog pin</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
