ra-rs/ra/svd/vendor/R7FA6T2BD.svd
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>IIRCH%sCNT</name>
                    <description>Channel %s Control Register</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>STGSEL</name>
                            <description>Stage selection bit</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The corresponding stage is not used for channel n.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The corresponding stage is used for channel n.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>IIRCH%sINT</name>
                    <description>Channel %s Interrupt Enable Register</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>CPRCFIE</name>
                            <description>Channel processing completion interrupt enable bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The generation of channel processing completion interrupt requests is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The generation of channel processing completion interrupt requests is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ORDYIE</name>
                            <description>Output data preparation completion interrupt enable bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The generation of output data preparation completion interrupt requests is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The generation of output data preparation completion interrupt requests is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CERRIE</name>
                            <description>Operation error interrupt enable bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The generation of operation error interrupt requests is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The generation of operation error interrupt requests is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>IIRCH%sSTS</name>
                    <description>Channel %s Status Register</description>
                    <addressOffset>0x10D</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>CPRCS</name>
                            <description>Channel processing status flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The channel processing is not being performed.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The channel processing is being performed.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CPRCFF</name>
                            <description>Channel processing completion flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The channel processing is not completed.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The channel processing is completed.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ORDYF</name>
                            <description>Output data preparation completion flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The output data preparation is not completed.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The output data preparation is completed.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CERRF</name>
                            <description>Operation error flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No operation error has occurred.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An operation error has occurred.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>IIRCH%sFCLR</name>
                    <description>Channel %s Flag Clear Register</description>
                    <addressOffset>0x10E</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>CPRCFFCLR</name>
                            <description>Channel processing completion flag clear bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Clears the CPRCFF flag of the IIRCHnSTS register.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CERRFCLR</name>
                            <description>Operation error flag clear bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Clears the CERRF flag of the IIRCHnSTS register.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>IIRSTG%sB0</name>
                    <description>Stage %s Coefficient b0 Register</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>IIRSTG%sB1</name>
                    <description>Stage %s Coefficient b1 Register</description>
                    <addressOffset>0x404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>IIRSTG%sB2</name>
                    <description>Stage %s Coefficient b2 Register</description>
                    <addressOffset>0x408</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>IIRSTG%sA1</name>
                    <description>Stage %s Coefficient a1 Register</description>
                    <addressOffset>0x40C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>IIRSTG%sA2</name>
                    <description>Stage %s Coefficient a2 Register</description>
                    <addressOffset>0x410</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>IIRSTG%sD0</name>
                    <description>Stage %s Delay Data D0 Register</description>
                    <addressOffset>0x414</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>IIRSTG%sD1</name>
                    <description>Stage %s Delay Data D1 Register</description>
                    <addressOffset>0x418</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                </register>
