ra-rs/ra/svd/vendor/R7FA6T2BD.svd
                <register>
                    <name>GTONCCRD</name>
                    <description>GPT Output Stopping Control Group D Controlling Register</description>
                    <addressOffset>0x344</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0100</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>NE</name>
                            <description>Direct Stopping Request Setting</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The signal for detection is not set as a direct stopping request signal</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The signal for detection is set as a direct stopping request signal</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NFS</name>
                            <description>Direct Stopping Request Selection</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x0</name>
                                    <description>Comparator level detection 0</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1</name>
                                    <description>Comparator level detection 1</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x2</name>
                                    <description>Comparator level detection 2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4</name>
                                    <description>Comparator level detection 3</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7</name>
                                    <description>GTETRGn pin input level detection (n = A to D)</description>
                                    <value>0x7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NFV</name>
                            <description>Direct Stopping Request Active Sense</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stopping output is requested when the output stopping detection signal is 0</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stopping output is requested when the output stopping detection signal is 1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>CANFD</name>
            <description>CANFD Module Control</description>
            <baseAddress>0x400B0000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>160</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xB8</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC0</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD8</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x120</offset>
                <size>268</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x280</offset>
                <size>256</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x520</offset>
                <size>604</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x920</offset>
                <size>680</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD20</offset>
                <size>680</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1120</offset>
                <size>680</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1520</offset>
                <size>680</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CFDC0NCFG</name>
                    <description>Channel 0 Nominal Bitrate Configuration Register</description>
                    <addressOffset>0x0000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>NBRP</name>
                            <description>Channel Nominal Baud Rate Prescaler</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NSJW</name>
                            <description>Resynchronization Jump Width</description>
                            <lsb>10</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NTSEG1</name>
                            <description>Timing Segment 1</description>
                            <lsb>17</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NTSEG2</name>
                            <description>Timing Segment 2</description>
                            <lsb>25</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
