ra-rs/ra/svd/vendor/R7FA6T2BD.svd
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x004</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDCFDF%s</name>
                    <description>Common FIFO Access Data Field %s Registers</description>
                    <addressOffset>0x05C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMID%s</name>
                    <description>TX Message Buffer ID Registers</description>
                    <addressOffset>0x0604</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMID</name>
                            <description>TX Message Buffer ID Field</description>
                            <lsb>0</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THLEN</name>
                            <description>Tx History List Entry</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Entry not stored in THL after successful TX</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Entry stored in THL after successful TX</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TMRTR</name>
                            <description>TX Message Buffer RTR bit</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TMIDE</name>
                            <description>TX Message Buffer IDE bit</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>STD-ID is transmitted</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>EXT-ID is transmitted</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMPTR%s</name>
                    <description>TX Message Buffer Pointer Register </description>
                    <addressOffset>0x0608</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDLC</name>
                            <description>TX Message Buffer DLC Field</description>
                            <lsb>28</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMFDCTR%s</name>
                    <description>TX Message Buffer CANFD Control Register </description>
                    <addressOffset>0x060C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMESI</name>
                            <description>Error State Indicator bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CANFD frame to transmit by error active node</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CANFD frame to transmit by error passive node</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TMBRS</name>
                            <description>Bit Rate Switch bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CANFD frame to transmit with no bit rate switch</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CANFD frame to transmit with bit rate switch</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TMFDF</name>
                            <description>CAN FD Format bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non CANFD frame to transmit</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CANFD frame to transmit</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TMIFL</name>
                            <description>TX Message Buffer Information Label Field</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMPTR</name>
                            <description>TX Message Buffer Pointer Field</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_0</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x0610</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_1</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x0614</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_2</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x0618</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_3</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x061C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_4</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x0620</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_5</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x0624</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
