ra-rs/ra/svd/vendor/R7FA6T2BD.svd
                <register>
                    <name>MFCLR</name>
                    <description>Manchester Flag Clear Register</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PFERC</name>
                            <description>PFER clear bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SYERC</name>
                            <description>SYER clear bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SBERC</name>
                            <description>SBER clear bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MERC</name>
                            <description>MER clear bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XFCLR</name>
                    <description>Simple LIN Flag Clear Register</description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>BFOC</name>
                            <description>BFOF clear bit</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCDC</name>
                            <description>BCDF clear bit</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BFDC</name>
                            <description>BFDF clear bit</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CF0MC</name>
                            <description>CF0MF clear bit</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CF1MC</name>
                            <description>CF1MF clear bit</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIBDC</name>
                            <description>PIBDF clear bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COFC</name>
                            <description>COFF clear bit</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>AEDC</name>
                            <description>AEDF clear bit</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="SCI_B0">
            <name>SCI_B1</name>
            <description>Serial Communication Interface 1</description>
            <baseAddress>0x40118100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI_B0">
            <name>SCI_B2</name>
            <description>Serial Communication Interface 2</description>
            <baseAddress>0x40118200</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI_B0">
            <name>SCI_B3</name>
            <description>Serial Communication Interface 3</description>
            <baseAddress>0x40118300</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI_B0">
            <name>SCI_B4</name>
            <description>Serial Communication Interface 4</description>
            <baseAddress>0x40118400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI_B0">
            <name>SCI_B9</name>
            <description>Serial Communication Interface 9</description>
            <baseAddress>0x40118900</baseAddress>
        </peripheral>
        <peripheral>
            <name>SPI_B0</name>
            <description>Serial Peripheral Interface 0</description>
            <baseAddress>0x4011A000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>52</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x50</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x58</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x68</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SPDR</name>
                    <description>SPI Data Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                </register>
                <register>
                    <name>SPDECR</name>
                    <description>SPI Delay Control Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SCKDL</name>
                            <description>RSPCK Delay</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>1RSPCK</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>2RSPCK</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>3RSPCK</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>4RSPCK</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>5RSPCK</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>6RSPCK</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>7RSPCK</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>8RSPCK</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SLNDL</name>
                            <description>SSL Negation Delay</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>1RSPCK</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>2RSPCK</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>3RSPCK</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>4RSPCK</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>5RSPCK</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>6RSPCK</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>7RSPCK</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>8RSPCK</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPNDL</name>
                            <description>SPI Next-Access Delay</description>
                            <lsb>16</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>1RSPCK + 5TCLK</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>2RSPCK + 5TCLK</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>3RSPCK + 5TCLK</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>4RSPCK + 5TCLK</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>5RSPCK + 5TCLK</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>6RSPCK + 5TCLK</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>7RSPCK + 5TCLK</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>8RSPCK + 5TCLK</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
