ra-rs/ra/svd/vendor/R7FA6T2BD.svd
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Counter count up enabled at the ELC_GPTE input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>USELCF</name>
                            <description>ELC_GPTF Event Source Counter Count Up Enable</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Counter count up disabled at the ELC_GPTF input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Counter count up enabled at the ELC_GPTF input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>USELCG</name>
                            <description>ELC_GPTG Event Source Counter Count Up Enable</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Counter count up disabled at the ELC_GPTG input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Counter count up enabled at the ELC_GPTG input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>USELCH</name>
                            <description>ELC_GPTH Event Source Counter Count Up Enable</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Counter count up disabled at the ELC_GPTH input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Counter count up enabled at the ELC_GPTH input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>USILVL</name>
                            <description>External Input Level Source Count-Up Enable</description>
                            <lsb>24</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>Disables count-up by external input level</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0001</name>
                                    <description>Setting prohibited</description>
                                    <value>#0001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010</name>
                                    <description>Enables count-up by GTIOCnA pin input level 0</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>Enables count-up by GTIOCnA pin input level 1</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>Enables count-up by GTIOCnB pin input level 0</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>Enables count-up by GTIOCnB pin input level 1</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0110</name>
                                    <description>Setting prohibited</description>
                                    <value>#0110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0111</name>
                                    <description>Setting prohibited</description>
                                    <value>#0111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1000</name>
                                    <description>Enables count-up by GTETRGA pin input level 0</description>
                                    <value>#1000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1001</name>
                                    <description>Enables count-up by GTETRGA pin input level 1</description>
                                    <value>#1001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1010</name>
                                    <description>Enables count-up by GTETRGB pin input level 0</description>
                                    <value>#1010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1011</name>
                                    <description>Enables count-up by GTETRGB pin input level 1</description>
                                    <value>#1011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1100</name>
                                    <description>Enables count-up by GTETRGC pin input level 0</description>
                                    <value>#1100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1101</name>
                                    <description>Enables count-up by GTETRGC pin input level 1</description>
                                    <value>#1101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1110</name>
                                    <description>Enables count-up by GTETRGD pin input level 0</description>
                                    <value>#1110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111</name>
                                    <description>Enables count-up by GTETRGD pin input level 1</description>
                                    <value>#1111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
