ra-rs/ra/svd/vendor/R7FA6T2BD.svd
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>ADPGACR%s</name>
                    <description>Programmable Gain Amplifier Control Register %s</description>
                    <addressOffset>0x2C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xfffffffd</resetMask>
                    <fields>
                        <field>
                            <name>PGADEN</name>
                            <description>PGA Unit n Input Mode Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Single-ended Input mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Pseudo-differential Input mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PGASEL1</name>
                            <description>PGA Unit n Amplifier Output Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not output the signal in a path through the PGA</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Output the signal in a path through the PGA</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PGAENAMP</name>
                            <description>PGA Unit n Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable the PGA</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable the PGA</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PGAGEN</name>
                            <description>PGA Unit n Gain Setting Enable</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable gain setting</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable gain setting</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PGADG</name>
                            <description>PGA Unit n Differential Input Gain Setting</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>× 1.500</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>× 2.333</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>× 4.000</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>× 5.667</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PGAGAIN</name>
                            <description>PGA Unit n Gain Setting</description>
                            <lsb>24</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x0</name>
                                    <description>× 2.000 (PGA is Single-ended Input mode) Setting prohibited (PGA is Pseudo-differential Input mode) </description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1</name>
                                    <description>× 2.500 (PGA is Single-ended Input mode) × 1.500 (PGA is Pseudo-differential Input mode) </description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x2</name>
                                    <description>× 2.667 (PGA is Single-ended Input mode) Setting prohibited (PGA is Pseudo-differential Input mode) </description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3</name>
                                    <description>× 2.857 (PGA is Single-ended Input mode) Setting prohibited (PGA is Pseudo-differential Input mode) </description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4</name>
                                    <description>× 3.077 (PGA is Single-ended Input mode) Setting prohibited (PGA is Pseudo-differential Input mode) </description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5</name>
                                    <description>× 3.333 (PGA is Single-ended Input mode) × 2.333 (PGA is Pseudo-differential Input mode) </description>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6</name>
                                    <description>× 3.636 (PGA is Single-ended Input mode) Setting prohibited (PGA is Pseudo-differential Input mode) </description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7</name>
                                    <description>× 4.000 (PGA is Single-ended Input mode) Setting prohibited (PGA is Pseudo-differential Input mode) </description>
                                    <value>0x7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x8</name>
                                    <description>× 4.444 (PGA is Single-ended Input mode) Setting prohibited (PGA is Pseudo-differential Input mode) </description>
                                    <value>0x8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x9</name>
                                    <description>× 5.000 (PGA is Single-ended Input mode) × 4.000 (PGA is Pseudo-differential Input mode) </description>
                                    <value>0x9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xA</name>
                                    <description>× 5.714 (PGA is Single-ended Input mode) Setting prohibited (PGA is Pseudo-differential Input mode) </description>
                                    <value>0xa</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xB</name>
                                    <description>× 6.667 (PGA is Single-ended Input mode) × 5.667 (PGA is Pseudo-differential Input mode) </description>
                                    <value>0xb</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xC</name>
                                    <description>× 8.000 (PGA is Single-ended Input mode) Setting prohibited (PGA is Pseudo-differential Input mode) </description>
                                    <value>0xc</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xD</name>
                                    <description>× 10.000 (PGA is Single-ended Input mode) Setting prohibited (PGA is Pseudo-differential Input mode) </description>
                                    <value>0xd</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xE</name>
                                    <description>× 13.333 (PGA is Single-ended Input mode) Setting prohibited (PGA is Pseudo-differential Input mode) </description>
                                    <value>0xe</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xF</name>
                                    <description>Setting prohibited </description>
                                    <value>0xf</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADPGAMONCR</name>
                    <description>Programable Gain Amp Monitor Output Control Register</description>
                    <addressOffset>0x300</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PGAMON</name>
                            <description>PGA Monitor Signal Selection</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x0</name>
                                    <description>Not select monitor signal (Hi-Z)</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1</name>
                                    <description>PGA output</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MONSEL0</name>
                            <description>PGA Unit 0 Monitor Output Enable</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable monitor output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable monitor output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MONSEL1</name>
                            <description>PGA Unit 1 Monitor Output Enable</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable monitor output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable monitor output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MONSEL2</name>
                            <description>PGA Unit 2 Monitor Output Enable</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable monitor output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable monitor output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MONSEL3</name>
                            <description>PGA Unit 3 Monitor Output Enable</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable monitor output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable monitor output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADREFCR</name>
                    <description>Internal Reference Voltage Monitor Enable Register</description>
                    <addressOffset>0x320</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>VDE</name>
                            <description>Internal Reference Voltage A/D Conversion Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable A/D conversion of internal reference voltage</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable A/D conversion of internal reference voltage</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
