ra-rs/ra/svd/vendor/R7FA6T2BD.svd
                <register>
                    <name>ADCMPMDR1</name>
                    <description>Compare Match Mode Selection Register 1</description>
                    <addressOffset>0x44C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CMPMD4</name>
                            <description>Compare Match 4 : Match Mode Selection</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Generate the match event when high-side level or more</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Generate the match event when low-side level or less</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Generate the match event when high-side level or more, or low-side level or less</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Generate the match event when low-side level or more and high-side level or less</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPMD5</name>
                            <description>Compare Match 5 : Match Mode Selection</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Generate the match event when high-side level or more</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Generate the match event when low-side level or less</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Generate the match event when high-side level or more, or low-side level or less</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Generate the match event when low-side level or more and high-side level or less</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPMD6</name>
                            <description>Compare Match 6 : Match Mode Selection</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Generate the match event when high-side level or more</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Generate the match event when low-side level or less</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Generate the match event when high-side level or more, or low-side level or less</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Generate the match event when low-side level or more and high-side level or less</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPMD7</name>
                            <description>Compare Match 7 : Match Mode Selection</description>
                            <lsb>24</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Generate the match event when high-side level or more</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Generate the match event when low-side level or less</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Generate the match event when high-side level or more, or low-side level or less</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Generate the match event when low-side level or more and high-side level or less</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>ADCMPTBR%s</name>
                    <description>Compare Match Table Register %s</description>
                    <addressOffset>0x458</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xffff0000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CMPTBL</name>
                            <description>Compare Match Table n : Low-side level</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPTBH</name>
                            <description>Compare Match Table n : High-side level</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADFIFOCR</name>
                    <description>FIFO Control Register</description>
                    <addressOffset>0x4C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FIFOEN0</name>
                            <description>Scan Group n FIFO Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable scan group n FIFO function</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable scan group n FIFO function</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIFOEN1</name>
                            <description>Scan Group n FIFO Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable scan group n FIFO function</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable scan group n FIFO function</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIFOEN2</name>
                            <description>Scan Group n FIFO Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable scan group n FIFO function</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable scan group n FIFO function</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIFOEN3</name>
                            <description>Scan Group n FIFO Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable scan group n FIFO function</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable scan group n FIFO function</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIFOEN4</name>
                            <description>Scan Group n FIFO Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable scan group n FIFO function</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable scan group n FIFO function</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIFOEN5</name>
                            <description>Scan Group n FIFO Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable scan group n FIFO function</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable scan group n FIFO function</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIFOEN6</name>
                            <description>Scan Group n FIFO Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable scan group n FIFO function</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable scan group n FIFO function</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIFOEN7</name>
                            <description>Scan Group n FIFO Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable scan group n FIFO function</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable scan group n FIFO function</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIFOEN8</name>
                            <description>Scan Group n FIFO Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable scan group n FIFO function</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable scan group n FIFO function</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
