ra-rs/ra/svd/vendor/R7FA6T2BD.svd
                <register>
                    <dim>37</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-36</dimIndex>
                    <name>ADDOPCRB%s</name>
                    <description>A/D Conversion Data Operation Control B Register %s</description>
                    <addressOffset>0x608</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>AVEMD</name>
                            <description>Addition/Averaging Mode Selection</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Not use Addition/Averaging mode</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Addition mode</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Averaging mode</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADC</name>
                            <description>Addition/Averaging Times Selection</description>
                            <lsb>8</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x0</name>
                                    <description>1-time conversion (no addition, same as normal conversion)</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1</name>
                                    <description>2-time conversion (1 addition)</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3</name>
                                    <description>4-time conversion (3 additions)</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4</name>
                                    <description>8-time conversion (7 additions)</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5</name>
                                    <description>16-time conversion (15 additions)</description>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6</name>
                                    <description>32-time conversion (31 additions)</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7</name>
                                    <description>64-time conversion (63 additions)</description>
                                    <value>0x7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x8</name>
                                    <description>128-time conversion (127 additions)</description>
                                    <value>0x8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x9</name>
                                    <description>256-time conversion (255 additions)</description>
                                    <value>0x9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xA</name>
                                    <description>512-time conversion (511 additions)</description>
                                    <value>0xa</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xB</name>
                                    <description>1024-time conversion (1023 additions)</description>
                                    <value>0xb</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPTBLE0</name>
                            <description>Compare Match Enable</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable the compare match with the compare match table m</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable the compare match with the compare match table m</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPTBLE1</name>
                            <description>Compare Match Enable</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable the compare match with the compare match table m</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable the compare match with the compare match table m</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPTBLE2</name>
                            <description>Compare Match Enable</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable the compare match with the compare match table m</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable the compare match with the compare match table m</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPTBLE3</name>
                            <description>Compare Match Enable</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable the compare match with the compare match table m</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable the compare match with the compare match table m</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPTBLE4</name>
                            <description>Compare Match Enable</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable the compare match with the compare match table m</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable the compare match with the compare match table m</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPTBLE5</name>
                            <description>Compare Match Enable</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable the compare match with the compare match table m</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable the compare match with the compare match table m</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPTBLE6</name>
                            <description>Compare Match Enable</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable the compare match with the compare match table m</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable the compare match with the compare match table m</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPTBLE7</name>
                            <description>Compare Match Enable</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable the compare match with the compare match table m</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable the compare match with the compare match table m</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>37</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-36</dimIndex>
                    <name>ADDOPCRC%s</name>
                    <description>A/D Conversion Data Operation Control C Register %s</description>
                    <addressOffset>0x60C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LIMTBLS</name>
                            <description>Limiter Clip Table Selection</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADPRC</name>
                            <description>A/D Conversion Data Format Selection</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Store the A/D conversion result as 16-bit data format</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Store the A/D conversion result as 14-bit data format</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Store the A/D conversion result as 12-bit data format</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Store the A/D conversion result as 10-bit data format</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SIGNSEL</name>
                            <description>A/D Conversion Data Signed/Un-signed Selection</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Signed data format</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Un-signed data format</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCALSTR</name>
                    <description>A/D Converter Self-calibration Start Register</description>
                    <addressOffset>0xC00</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>ADCALST0</name>
                            <description>A/D Converter Unit 0 (ADC0) Self-calibration Start Control</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ADCALST1</name>
                            <description>A/D Converter Unit 1 (ADC1) Self-calibration Start Control</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
