ra-rs/ra/svd/vendor/R7FA6T2BD.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="DAC120">
            <name>DAC121</name>
            <description>12-bit D/A converter 1</description>
            <baseAddress>0x40172100</baseAddress>
        </peripheral>
        <peripheral>
            <name>TSD</name>
            <description>Temperature Sensor Calibration Data</description>
            <baseAddress>0x407FB000</baseAddress>
            <addressBlock>
                <offset>0x17C</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TSCDR</name>
                    <description>Temperature Sensor Calibration Data Register</description>
                    <addressOffset>0x017C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffff0000</resetMask>
                    <fields>
                        <field>
                            <name>TSCDR</name>
                            <description>Temperature Sensor Calibration Data</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>FLAD</name>
            <description>Data Flash</description>
            <baseAddress>0x407FC000</baseAddress>
            <addressBlock>
                <offset>0x40</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FCKMHZ</name>
                    <description>Data Flash Access Frequency Register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x3c</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>FCKMHZ</name>
                            <description>Data Flash Access Frequency Register</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>FACI</name>
            <description>Flash Application Command Interface</description>
            <baseAddress>0x407FE000</baseAddress>
            <addressBlock>
                <offset>0x10</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x30</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x44</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x78</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x7C</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x80</offset>
                <size>6</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8C</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA0</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD0</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD4</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD8</offset>
                <size>10</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xE4</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xE8</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FASTAT</name>
                    <description>Flash Access Status Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>DFAE</name>
                            <description>Data Flash Memory Access Violation Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No data flash memory access violation has occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A data flash memory access violation has occurred.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDLK</name>
                            <description>Command Lock Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The flash sequencer is not in the command-locked state</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The flash sequencer is in the command-locked state.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFAE</name>
                            <description>Code Flash Memory Access Violation Flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No code flash memory access violation has occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A code flash memory access violation has occurred.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FAEINT</name>
                    <description>Flash Access Error Interrupt Enable Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x98</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>DFAEIE</name>
                            <description>Data Flash Memory Access Violation Interrupt Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Generation of an FIFERR interrupt request is disabled when FASTAT.DFAE is set to 1</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Generation of an FIFERR interrupt request is enabled when FASTAT.DFAE is set to 1.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDLKIE</name>
                            <description>Command Lock Interrupt Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Generation of an FIFERR interrupt request is disabled when FASTAT.CMDLK is set to 1</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Generation of an FIFERR interrupt request is enabled when FASTAT.CMDLK is set to 1.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFAEIE</name>
                            <description>Code Flash Memory Access Violation Interrupt Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Generation of an FIFERR interrupt request is disabled when FASTAT.CFAE is set to 1</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Generation of an FIFERR interrupt request is enabled when FASTAT.CFAE is set to 1.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRDYIE</name>
                    <description>Flash Ready Interrupt Enable Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>FRDYIE</name>
                            <description>Flash Ready Interrupt Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Generation of an FRDY interrupt request is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Generation of an FRDY interrupt request is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSADDR</name>
                    <description>FACI Command Start Address Register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                </register>
                <register>
                    <name>FEADDR</name>
                    <description>FACI Command End Address Register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FEADDR</name>
                            <description>End Address for FACI Command Processing</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FMEPROT</name>
                    <description>Flash P/E Mode Entry Protection Register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0001</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>CEPROT</name>
                            <description>Code Flash P/E Mode Entry Protection</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>FENTRYC bit is not protected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>FENTRYC bit is protected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>Key Code</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FBPROT0</name>
                    <description>Flash Block Protection Register</description>
                    <addressOffset>0x78</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>BPCN0</name>
                            <description>Block Protection for Non-secure Cancel</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Block protection is enabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Block protection is disabled. </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>Key Code</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FBPROT1</name>
                    <description>Flash Block Protection for Secure Register</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>BPCN1</name>
                            <description>Block Protection for Secure Cancel</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Block protection is enabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Block protection is disabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>Key Code</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
